Documents/упСчетНаОплатуЗаказчику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упСчетНаОплатуЗаказчику</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упРасчетыСЗаказчиками</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аннулирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упБанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упФактическиеДоходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоОпераций</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчетов</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/упРасчетыСЗаказчиками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упРасчетыСЗаказчиками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КОплатеДоНачалаВыполненияРейса</Name>
					<Comment>Сумма</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОплатеДоНачалаРаботыСЗаявкой</Name>
					<Comment>Сумма</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АналитическийРазрезПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАналитическиеРазрезыПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/упСчетНаОплатуЗаказчику/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	мсвНепроверяемыхРеквизитов = Новый Массив;
	Если Не (Оплачен И Не Аннулирован) Тогда
		мсвНепроверяемыхРеквизитов.Добавить("ДатаОплаты");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, мсвНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")  Тогда
		ФактическиеДоходы = Неопределено;

		Если ДанныеЗаполнения.Свойство("ФактическиеДоходы", ФактическиеДоходы) Тогда
			сткЗначенияРеквизитов 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ФактическиеДоходы, "Организация, Заказчик, КонтрагентЗаказчика");
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, сткЗначенияРеквизитов);
			Сумма					= ДанныеЗаполнения.Сумма;
			СуммаНДС				= ДанныеЗаполнения.СуммаНДС;
			Контрагент 				= сткЗначенияРеквизитов.КонтрагентЗаказчика;
		Иначе	
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		КонецЕсли;

		БанковскийСчет 			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ОсновнойБанковскийСчет");
		ДокументОснование 		= ФактическиеДоходы;

		мсвРасшифровкаПлатежей = Неопределено;
		Если ДанныеЗаполнения.Свойство("РасшифровкаПлатежей", мсвРасшифровкаПлатежей) Тогда
			Для каждого СтрокаПлатеж Из мсвРасшифровкаПлатежей Цикл
				НоваяСтрока = РасшифровкаПлатежа.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПлатеж);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ВедетсяВалютныйУчет	= ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет");
		ДополнительныеСвойства.Вставить("ВедетсяВалютныйУчет", ВедетсяВалютныйУчет);
		упРаспределениеРасходов.ЗаполнитьДоходыРасходы(ЭтотОбъект, Отказ);
		
		// Расчеты с заказчиками
		ВестиУчетРасчетовСЗаказчиками		= ПолучитьФункциональнуюОпцию("упВестиУчетРасчетовСЗаказчиками");
		ДополнительныеСвойства.Вставить("ВестиУчетРасчетовСЗаказчиками", 	 ВестиУчетРасчетовСЗаказчиками);
		АналитическийРазрезПоПартнерам		= Неопределено;
		Если ВестиУчетРасчетовСЗаказчиками Тогда
			мсвЗаявки = РасшифровкаПлатежа.ВыгрузитьКолонку("ОбъектРасчетов");
			мсвЗаявки = ОбщегоНазначенияКлиентСервер.СвернутьМассив(мсвЗаявки);
			тбзАналитическиеРазрезПоЗаявкам = упУправленияЗаявками.ПодобратьАналитическийРазрезПоПартнерамДляКаждойЗаявки(Организация, Заказчик, Контрагент, мсвЗаявки, Отказ);
			Если НЕ Отказ Тогда
				ДополнительныеСвойства.Вставить("АналитическиеРазрезыПоПартнерам", 	 тбзАналитическиеРазрезПоЗаявкам)
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	тбзАналитическиеРазрезыПоПартнерам = ДополнительныеСвойства.АналитическиеРазрезыПоПартнерам;
		
	тбзРасшифровкиПлатежей = ДополнительныеСвойства.РасшифровкаПлатежа;
	тбзРасшифровкиПлатежей.Колонки.Добавить("АналитическийРазрезПоПартнерам", Новый ОписаниеТипов("СправочникСсылка.упАналитическиеРазрезыПоПартнерам"));
	
	Если Не тбзАналитическиеРазрезыПоПартнерам = Неопределено Тогда
		
		Для каждого СтрокаРасшифровки Из тбзРасшифровкиПлатежей Цикл
			мсвСтрокиАналитическиеРазрезы = тбзАналитическиеРазрезыПоПартнерам.НайтиСтроки(Новый Структура("ЗаявкаНаПеревозкуГруза", СтрокаРасшифровки.ОбъектРасчетов));
			Если мсвСтрокиАналитическиеРазрезы.Количество() > 0 Тогда
				СтрокаРасшифровки.АналитическийРазрезПоПартнерам = мсвСтрокиАналитическиеРазрезы[0].АналитическийРазрезПоПартнерам;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.упРасчетыСЗаказчиками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = тбзРасшифровкиПлатежей;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("АналитическийРазрезПоПартнерам", 	"АналитическийРазрезПоПартнерам");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ОбъектРасчетов", 					"ОбъектРасчетов");
	
	упСервисныеФункции.УстановитьУправляемуюБлокировку(БлокировкаДанных, Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	РеквизитыОбъекта = Новый Структура("Дата, РасшифровкаПлатежа, Аннулирован", ?(ЗначениеЗаполнено(ДатаОплаты), ДатаОплаты, Дата), тбзРасшифровкиПлатежей, Аннулирован); 
	
	// Очищаются записи регистров остатков.
	Движения.упРасчетыСЗаказчиками.Прочитать();
	Если Движения.упРасчетыСЗаказчиками.Количество() > 0 Тогда
		Движения.упРасчетыСЗаказчиками.Очистить();
		Движения.упРасчетыСЗаказчиками.Записать(Истина);
	КонецЕсли;
	
	Если Оплачен Тогда
		упРасчетыСЗаказчиками.СформироватьДвиженияРасчетыСЗаказчиками(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
